Tekla Open API Reference for Tekla Structures 2025
ComponentItemEnumerator Properties
The ComponentItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a component item instance of the current element.
Top
See Also
Reference
ComponentItemEnumerator Class
Tekla.Structures.Catalogs Namespace